; domain
(define (domain blocksworld-domain)
 (:requirements :strips :typing :constraints :action-costs)
 (:types block)
 (:predicates (clear ?obj - block) (ontable ?obj - block) (handempty) (holding ?obj - block) (on ?obj1 - block ?obj2 - block))
 (:functions (total-cost))
 (:action pickup
  :parameters ( ?obj - block)
  :precondition (and (clear ?obj) (ontable ?obj) (handempty))
  :effect (and (holding ?obj) (not (clear ?obj)) (not (ontable ?obj)) (not (handempty)) (increase (total-cost) 1)))
 (:action putdown
  :parameters ( ?obj - block)
  :precondition (and (holding ?obj))
  :effect (and (clear ?obj) (handempty) (ontable ?obj) (not (holding ?obj)) (increase (total-cost) 1)))
 (:action stack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (clear ?underobj) (holding ?obj))
  :effect (and (handempty) (clear ?obj) (on ?obj ?underobj) (not (clear ?underobj)) (not (holding ?obj)) (increase (total-cost) 1)))
 (:action unstack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (on ?obj ?underobj) (clear ?obj) (handempty))
  :effect (and (holding ?obj) (clear ?underobj) (not (on ?obj ?underobj)) (not (clear ?obj)) (not (handempty)) (increase (total-cost) 1)))
)

; problem
(define (problem blocksworld-problem)
 (:domain blocksworld-domain)
 (:objects
   purple_block_1 blue_block_1 purple_block_2 grey_block_1 blue_block_2 black_block_1 green_block_1 - block
 )
 (:init (ontable purple_block_1) (ontable blue_block_1) (ontable purple_block_2) (on grey_block_1 purple_block_1) (on blue_block_2 purple_block_2) (on black_block_1 blue_block_2) (on green_block_1 blue_block_1) (clear grey_block_1) (clear black_block_1) (clear green_block_1) (handempty) (= (total-cost) 0))
 (:goal (and (ontable green_block_1)))
 (:constraints (sometime (holding green_block_1)) (sometime-before (holding green_block_1) (or (not (clear black_block_1)) (clear purple_block_2))))
 (:metric minimize (total-cost))
)

; plan
1. (unstack grey_block_1 purple_block_1)
   deleted: (on grey_block_1 purple_block_1) (clear grey_block_1) (handempty)
   added: (holding grey_block_1) (clear purple_block_1)
   goals met: 0 of 1
2. (stack grey_block_1 black_block_1)
   deleted: (clear black_block_1) (holding grey_block_1)
   added: (handempty) (clear grey_block_1) (on grey_block_1 black_block_1)
   goals met: 0 of 1
3. (unstack green_block_1 blue_block_1)
   deleted: (on green_block_1 blue_block_1) (clear green_block_1) (handempty)
   added: (holding green_block_1) (clear blue_block_1)
   goals met: 0 of 1
4. (putdown green_block_1)
   deleted: (holding green_block_1)
   added: (clear green_block_1) (handempty) (ontable green_block_1)
   goals met: 1 of 1
